import pandas as pd
data_df = pd.read_csv('housedata.csv')
data = {
     '证券名称' : ['格力电器','视觉中国','成都银行','中国联通','格力电器','视觉中国','成都银行','中国联通'],
     '摘要': ['证券买入','证券买入','证券买入','证券买入','证券卖出','证券卖出','证券卖出','证券卖出'],
     '成交数量' : [500,1000,1500,2000,500,500,1000,1500],
     '成交金额' : [-5000,-10000,-15000,-20000,5500,5500,11000,15000]
 }
 

df = pd.DataFrame(data, index = ['2018-2-1','2018-2-1','2018-2-1','2018-2-1','2018-2-2','2018-2-2','2018-2-2','2018-2-3'])

index = ~((df['成交金额'] > 1000) & (df['成交数量']<=1000))
data_df = data_df.drop(['Id'],axis="columns")
print(data_df)
